shaspitz/orbit-stabilization/PSOC Examples/PIXY2LabVIEW.cydsn/Generated_Source/PSoC5/PIXYCountReset.h
/*******************************************************************************
* File Name: PIXYCountReset.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_PIXYCountReset_H) /* CY_CONTROL_REG_PIXYCountReset_H */
#define CY_CONTROL_REG_PIXYCountReset_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} PIXYCountReset_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    PIXYCountReset_Write(uint8 control) ;
uint8   PIXYCountReset_Read(void) ;

void PIXYCountReset_SaveConfig(void) ;
void PIXYCountReset_RestoreConfig(void) ;
void PIXYCountReset_Sleep(void) ; 
void PIXYCountReset_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define PIXYCountReset_Control        (* (reg8 *) PIXYCountReset_Sync_ctrl_reg__CONTROL_REG )
#define PIXYCountReset_Control_PTR    (  (reg8 *) PIXYCountReset_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_PIXYCountReset_H */


/* [] END OF FILE */
